export const dynamic = "force-static"; // This is optional, but good for fully static pages
export const revalidate = 3600; // Optional: revalidate every hour

export default function TermsOfUse() {
  return (
    <div className="container mx-auto p-6">
      <h1 className="text-3xl font-bold mb-6 text-center">תנאי שימוש באתר</h1>
      <section className="mb-6" dir="rtl">
        <h2 className="text-2xl font-semibold mb-2">הקדמה</h2>
        <p>
          1. אתר האינטרנט מופעל ע&quot;י &quot;מגה איבנטס&quot; (להלן:
          &quot;האתר&quot; או &quot;מגה איבנטס&quot;). האתר משמש כאתר סחר
          אלקטרוני לרכישת מוצרים ו/או שירותים בתחום התעופה והתיירות על ידי
          גולשים באינטרנט בישראל.
        </p>
        <p>
          2. השימוש באתר כפוף לתנאים המפורטים בתקנון שלהן. תקנון זה מהווה הסכם
          בין מגה איבנטס לבין המשתמש ו/או הלקוח. המשתמש מתבקש לקרוא תקנון זה
          בקפידה, שכן זכויות וחובותיו נקבעים על פיו.
        </p>
        <p>
          3. אישור המשתמש בשולי התקנון (על ידי סימון &quot;אני מסכים לאמור
          בתקנון&quot;) מהווה הסכמה מוחלטת ובלתי חוזרת מצדו של המשתמש בכל האמור
          בתקנון ולכך שלא יהיו לו ו/או למי מטעמו כל טענה ו/או דרישה ו/או תביעה,
          במישרין ו/או בעקיפין כנגד מגה איבנטס ו/או מי מבעליה ו/או מי ממנהליה
          ו/או מטעמם אלא על פי המפורט בתקנון.
        </p>
        <p>
          4. למגה איבנטס שמורה הזכות לשנות בכל עת, את האמור בתקנון זה וכל שינוי
          כאמור יהיה תקף ממועד הכללת השינוי באתר. התקנון המחייב לגבי כל הזמנה
          הוא התקנון המופיע באתר בעת ביצוע ההזמנה.
        </p>
        <p>5. האמור בלשון זכר בתקנון – אף לשון נקבה במשמע, וכן להיפך.</p>
        <p>
          6. גלישה באתר ו/או רכישת מוצר ו/או שירות באמצעות האתר ו/או באמצעות
          מרכז המידע הטלפוני, מהווה את הסכמתך לקבל ולנהוג לפי התקנון, ולפיכך יש
          לקרוא תקנון זה במלואו ובעיון.
        </p>
        <p>
          7. אם אינך מסכים לתנאי מתנאי התקנון ו/או הסכם ההזמנה המפורט בו, הנך
          מתבקש לא לעשות כל שימוש באתר. גלישה באתר ו/או ביצוע רכישות על ידך,
          משמען הסכמתך המלאה לאמור בתקנון זה.
        </p>
        <p>
          8. הוראות תקנון זה וכן סיכום ההזמנה המצורף אליו והמהווה חלק בלתי נפרד
          ממנו, יחולו על כל שימוש ורכישה שיעשו באתר, ויהוו את הבסיס המשפטי בכל
          נושא בינך לבין האתר ו/או כנגד מי מבעליו ו/או מפעיליו. עקב כך, הנך
          מתבקש לקרוא תקנון זה במלואו ובעיון. בכל מקרה של סתירה ו/או פער בין
          האמור בתקנון זה לבין סיכום ההזמנה, יגבר האמור בסיכום ההזמנה על האמור
          בתקנון זה
        </p>
      </section>
      <section className="mb-6" dir="rtl">
        <h2 className="text-2xl font-semibold mb-2">כללי</h2>
        <p>
          1. מגה איבנטס מאפשרת לך לרכוש מוצרים ושירותים שונים באמצעות האתר ו/או
          באמצעות מוקד טלפוני.
        </p>
        <p>
          2. כדי לבצע הזמנה של מוצר או שירות המוצגים באתר, יש לבחור את המוצר או
          השירות המבוקשים ולהיכנס לדף הכולל מידע נוסף אודות המוצר או השירות.
        </p>
        <p>
          3. על מנת לעבור לבצע הזמנה באתר, יש להירשם על ידי הקלדת פרטים דוגמת
          דוא&quot;ל, מספר טלפון וכו&apos;.
        </p>
        <p>4. על המזמינים באתר לוודא כי ברשותם:</p>
        <p>4.1. דרכון תקף לשישה חודשים לפחות ממועד היציאה מהארץ.</p>
        <p>4.2. אשרת כניסה (ויזת תייר) למדינות המתוכננות לביקור.</p>
        <p>
          4.3. לפעול ע&quot;פ הנחיות המפורסמות לגבי תנאי הכניסה למדינות בתקופת
          הקורונה.
        </p>
        <p>
          5. אין מגה איבנטס אחראית לנזקי הנוסע שיגרמו עקב אי השגת אשרה מתאימה או
          עקב יציאתו לחו&quot;ל באשרה בלתי מתאימה או כלל ללא אשרה או יציאתו
          בדרכון מוגבל או אי התרת כניסתו לארץ זו או אחרת מכל סיבה שהיא, לרבות
          סירוב להנפיק אשרה בשל היות הנוסע אזרח של מדינה עוינת למדינה אשר מנפיקה
          את האשרה.
        </p>
        <p>
          6. יובהר ויודגש, ביצוע ההזמנה באתר אינו מהווה אישור של מגה איבנטס על
          ביצוע ההזמנה. אישור סופי של ההזמנה וחיוב כרטיס האשראי יבוצע רק לאחר
          קבלת אישור סופי מחברת כרטיס האשראי.
        </p>
        <p>
          7. לתשומת לבך, הגשת פרטים כוזבים הנה עבירה פלילית וצפויה לגרור הליכים
          משפטיים, לרבות תביעות בגין נזקים, שייגרמו למגה איבנטס ו/או למי מספקי
          השירותים האחרים ו/או למי מטעם אלו, שעקב ו/או בקשר למסירת הפרטים
          הכוזבים.
        </p>
        <p>
          8. כל טעות הנעשית על ידי המשתמש בהקלדת פרטי הרכישה, לרבות טעות בבחירת
          יעד הטיסה, מס&apos; הכרטיסים ו/או כמות השירותים המוזמנים ו/או טעות
          בהקשת גילאי הנוסעים תהיה באחריות המשתמש בלבד.
        </p>
        <p>
          9. במקרה בו לא אושרה העסקה על ידי חברת האשראי יקבל הגולש הודעה מתאימה
          מנציגי מגה איבנטס. לצורך השלמת העסקה יידרש הגולש להשיב לפניה של מגה
          איבנטס באמצעות דוא&quot;ל או טלפונית לצורך הסדרת אישור חברת האשראי
          לביצוע העסקה. פעולה תחשב למושלמת רק לאחר מסירת פרטי האשראי. לא פעל
          הגולש להסדרת האישור בתוך 7 ימים ממועד קבלת ההודעה על סירוב חברת האשראי
          למתן אישור לביצוע העסקה ובכל מקרה לא פחות משלושה ימים לפני התאריך
          המיועד למתן השירות, תהיה מגה איבנטס זכאית לבטל את ההזמנה.
        </p>
        <p>
          10. מחירי המוצרים והשירותים הנמכרים באמצעות האתר ומרכז המידע משתנים
          מעת לעת. במידה וקיימת אי התאמה בין המחירים המפורטים באתר לבין המחירים
          בפועל במרכז המידע, המחיר במרכז המידע הוא המחיר הקובע.
        </p>
        <p>
          11. מחירים הנקובים במטבע חוץ יגבו על פי שער העברות והמחאות גבוה של
          אותו מטבע ביום התשלום.
        </p>
      </section>
      <section className="mb-6" dir="rtl">
        <h2 className="text-2xl font-semibold mb-2">בעלות ושמירה על זכויות</h2>
        <p>
          1. האתר, הסימנים המסחריים הכלולים בו וכל מודל אחר הקשור בו הנם קניינה
          הפרטי הבלעדי של מגה איבנטס או במידה ומפורסמים בו גופים מסחריים אחרים,
          של אותם גופים. המשתמש באתר זה אינו מורשה להכניס שינויים בפריטי המידע,
          התוכנה, המוצרים ו/או השירותים ו/או כל דבר אחר שבאתר וכן אינו רשאי
          להעתיק, להפיץ, לשדר, לשכפל, לפרסם, למכור ו/או לעשות שימוש כלשהו, בדרך
          ישירה ו/או עקיפה, במידע ו/או בכל דבר אחר הקיים באתר, אלא אם ניתנה
          הרשות לכך מראש ובכתב על ידי מגה איבנטס.
        </p>
        <p>
          2. שימוש לא חוקי באתר זה ו/או במידע המופיע בו מהווה הפרה של זכויות
          יוצרים ו/או של חוקים אחרים הקשורים באתר.
        </p>
        <p>
          3. המשתמש מצהיר כי ידוע לו שהאתר וכל המידע המצוי בו, צורתו ועיצובו
          הינם קניינה הבלעדי של מגה איבנטס או במידה שפורסמו מפרסמים אחרים,
          קניינם של מפרסים אלו.
        </p>
        <p className="mt-2">כשרות להשתמש באתר</p>
        <p>
          1. כל משתמש רשאי להשתמש באתר ולבצע רכישות בכפוף למילוי התנאים המצטברים
          המפורטים להלן:
        </p>
        <p>
          1.1. המשתמש הינו כשיר לבצע פעולות משפטיות מחייבות. במידה והנך קטין
          (מתחת לגיל 18) או אינך זכאי לבצע פעולות משפטיות ללא אישור אפוטרופוס,
          יראו את שימושך באתר כאילו קיבלת את אישור האפוטרופוס.
        </p>
        <p>
          1.2. המשתמש הינו בעל תעודת זהות ישראלית תקפה או תאגיד המאוגד והרשום
          כדין בישראל.
        </p>
        <p>
          1.3. המשתמש הינו בעל כרטיס אשראי ישראלי או בינלאומי תקף, שהונפק בישראל
          על ידי אחת מחברות כרטיסי האשראי.
        </p>
        <p>
          1.4. המשתמש הינו בעל תא דואר אלקטרוני ברשת האינטרנט ובעל כתובת בישראל.
        </p>
        <p className="mt-2">ביטול ושינוי עסקה</p>
        <p>
          1. ביטול עסקאות יעשה בהתאם לתנאי ההתקשרות של מגה איבנטס ובכפוף לחוק
          הגנת הצרכן התשמ&quot;א – 1981 והכל כמפורט בתנאי ההתקשרות לטיסות
          בינלאומיות (לחץ כאן), או לטיסות פנים ארציות (לחץ כאן), או לחבילות נופש
          (לחץ כאן) או לטיולים מאורגנים (לחץ כאן) לפי העניין.
        </p>
        <p>הביטול יעשה באחת הדרכים הקבועות בחוק:</p>
        <p>
          1. בעל פה – בטלפון או בהודעה בעל פה במקום העסק, למעט אם נקבע לפי חוק
          כי ביטול העסקה ייעשה בדרך של הודעה בכתב.
        </p>
        <p>2. בדואר אלקטרוני בכתובת - support@mega-events.co.il</p>
        <p>
          3. כאשר ההתקשרות בעסקה נעשתה באינטרנט או במרכז המידע של מגה איבנטס
          ניתן לבטל בקישור הייעודי הבא - ביטול הזמנה. {/* TODO */}
        </p>
        <p>
          בהודעת ביטול יפרט הצרכן את שמו, מספר הזהות שלו, מספר ההזמנה, תאריך
          יציאה והאם נמסרת הודעת ביטול בע&quot;פ.
        </p>
        <p>
          כל מקרה של ביטול/שינוי ההזמנה יתבצע בהודעה בכתב בלבד (במכתב ובכפוף
          להוראות חוק הגנת הצרכן). תאריך הביטול/שינוי הקובע יהיה תאריך קבלת
          הודעת ביטול/שינוי במשרדי מגה איבנטס. במידה ויום קבלת ההודעה הינו יום
          מנוחה, ייחשב יום הביטול/שינוי כיום הראשון שלאחר המנוחה. הביטול ייכנס
          לתוקפו רק אם קיבל הנוסע אישור ביטול מנציג מגה איבנטס.
        </p>
        <p>
          מגה איבנטס ממליצה למשתמש באתר על רכישת ביטוח רפואי, ביטוח מטען וביטוח
          דמי ביטול וכן על בדיקת תנאי אותם ביטוחים.
        </p>
        <p>
          מבלי לגרוע מכלליות האמור לעיל מובהר בזאת, כי נשים הרות המחליטות לטוס
          על דעתן ואחריותן ולאחר שמובהר כי בכל טיסה לכל יעד ייתכן ותגרום פגיעה
          ו/או נזק לאישה ההרה ו/או לעובר הרי שנוסעת הרה עד שבוע 27 כולל, בחתימתה
          על טופס ההזמנה ו/או עם קבלת הכרטיסים ו/או ביצוע ההזמנה בחברת מגה
          איבנטס משחררת את מגה תיירות ו/או מי מטעמה מאחריות.{/* TODO */}
        </p>
        <p>
          בנוסף, ומבלי לגרוע מכלליות האמור לעיל נוסעת הרה משבוע 28 עד 33 לא
          כולל, המחליטה לטוס, חייבת להביא עימה אישור רפואי באנגלית בו רשום שאין
          מניעה לטוס ואין כל חשש ללידה מוקדמת.
        </p>
      </section>
      <section className="mb-6" dir="rtl">
        <h2 className="text-2xl font-semibold mb-2">שמירה על פרטיות וסודיות</h2>
        <p>
          1. מגה איבנטס מכבדת את פרטיות הלקוח ונוקטת באמצעים המקובלים לשמור
          עליה, ככל האפשר. לעיון <a href="#">(הכנס לינק) {/* TODO */}</a>{" "}
          במדיניות הפרטיות של האתר לחץ כאן.
        </p>
        <p>
          2. הואיל ומדיניות הפרטיות יכולה להשתנות מדי פעם, מומלץ לחזור ולקרוא את
          מדיניות הפרטיות מעת לעת.
        </p>
        <p className="mt-2">תנאים נוספים</p>
        <p>
          1. אין בהצגת המוצרים ו/או השירותים באתר, משום הבעת דעה לגביי אופיים או
          טיבם. תמונות המוצרים ו/או השירותים באתר הינם להמחשה בלבד וייתכנו
          הבדלים בין התמונות המוצגות באתר, חלקן או כולן לבין המוצרים ו/או
          השירותים הנמכרים בפועל.
        </p>
        <p>
          2. נפלה טעות קולמוס בתיאור ו/או מחיר המוצר ו/או השירות המוצגים באתר,
          לא יחייב הדבר את מגה איבנטס, אך מגה איבנטס תהא רשאית לבטל העסקה.
        </p>
        <p>
          3. מגה איבנטס לא תהא אחראית לתכנים המפורסמים בקישורים הקיימים באתר
          והמובילים לאתרים אחרים אליהם ניתן להגיע דרך אותם קישורים.
        </p>
        <p>
          4. מגה איבנטס אינה מתחייבת כי כל קישור (Link) יוביל לאתר אינטרנט פעיל.
        </p>
        <p>
          5. מגה איבנטס ו/או מי מטעמה לא יהיו אחראים ולא יישאו בכל נזק ישיר,
          עקיף, תוצאתי או מיוחד שנגרם למשתמש או לצד שלישי כתוצאה משימוש או רכישה
          באמצעות האתר, שלא על פי תקנון זה, תהא עילת התביעה אשר תהא.
        </p>
        <p>
          6. מגה איבנטס ו/או מי ממפעילי האתר ו/או ממנהליו ו/או מי מטעמם אינם
          אחראים לכך ששרת האתר נקי מווירוסים ו/או מרכיבים אחרים היכולים לפגוע
          במחשב ו/או בציוד אחר בשל כניסה לאתר. כמו כן, אין מגה איבנטס אחראית
          לנזק שייגרם מכישלון ו/או עיכוב בעת ניסיון להיכנס לאתר.
        </p>
        <p>
          7. מגה איבנטס לא תישא באחריות לכל פעילות בלתי חוקית שתתבצע ו/או תתקיים
          באתר על ידי משתמש ו/או גורם אחר. המשתמש ישפה או יפצה את מגה איבנטס
          ו/או מי מטעמה בגין כל תביעה ו/או הוצאה ו/או נזקים ו/או הוצאות משפטיות
          כלשהם אשר יחולו על מגה איבנטס כתוצאה משימוש באתר.
        </p>
        <p>
          8. אייקונים (Icons), כל מידע ו/או תצוגה המופיעים באתר, לרבות גרפיקה,
          עיצוב, הצגה מילולית, סימני מסחר, סימני לוגו וכן עריכתם והצגתם של אלה,
          הנם בבעלות בלעדית של מגה איבנטס ו/או מי מטעמה. אין להעתיק, לשכפל,
          להפיץ, לפרסם או להשתמש בכל דרך אחרת בתכנים המופיעים באתר אלא אם כן מגה
          איבנטס נתנה את הסכמתה לכך, בכתב ומראש.
        </p>
        <p>
          9. רישומי המחשב של מגה איבנטס בדבר הפעולות המתבצעות דרך האתר יהוו
          ראייה לכאורה לנכונות הפעולות.
        </p>
        <p>10. מגה איבנטס תהא רשאית לבטל עסקה ו/או מכירה כולה או חלקה:</p>
        <p>
          10.1. במקרה ונפלה בהצעה טעות קולמוס, בין אם במחיר המוצר ובין אם בתיאור
          המוצר.
        </p>
        <p>
          10.2. במידה שלא תתקבלנה הצעות עבור המוצרים/שירותים המוצעים למכירה.
        </p>
        <p>
          10.3. אם יתגלה כי ארעה תקלה בתקשורת ו/או בעיה טכנית אחרת שמנעה
          ממשתמשים את היכולת להוסיף ולהשתתף במכירה באופן תקין.
        </p>
        <p>
          10.4. במקרה של כוח עליון, פעולות מלחמה, איבה או טרור המונעים את המשך
          המכירה, ביצועה או השתתפות במכירה באופן תקין.
        </p>
        <p>
          10.5. אם יתברר כי העסקה ו/או המכירה לוותה בפעילות בלתי חוקית של
          הרוכשים ו/או מי מהם ו/או צד ג&apos; כלשהו.
        </p>
        <p>
          10.6. אם יתברר למגה איבנטס ו/או מי מטעמה כי הרוכש עלול לשוב ולמכור את
          המוצר או השירות אותו קנה לצד ג&apos; ו/או לסחור בו.
        </p>
      </section>
      <section className="mb-6" dir="rtl">
        <h2 className="text-2xl font-semibold mb-2">תנאים נוספים</h2>
        <p>
          1. פרשנות ואכיפתו של תקנון זה ו/או כל פעולה או סכסוך הנובע ממנו, יעשו
          בהתאם לחוקי מדינת ישראל.
        </p>
        <p>
          2. בכל מקרה של סכסוך משפטי תהיה לבתי המשפט בישראל, סמכות מקומית
          ייחודית לדון בתביעה.
        </p>
        <p>
          3. התקנון עודכן לאחרונה בתאריך 1.1.25 וניתן לשינוי בכל עת על ידי מגה
          איבנטס על פי שיקול דעתה הבלעדי.
        </p>
      </section>
    </div>
  );
}
