import FAQAccordion from "./FAQAccordion";

// Static FAQ data that will be included in the server component
const faqItems = [
  {
    question: "איך מזמינים כרטיסים לאירוע?",
    answer:
      "פשוט! בחרו את האירוע הרצוי, המשיכו לבחירת כמות הכרטיסים, תאריכי החופשה, סוג הטיסה והמלון, והשלימו את ההזמנה על ידי מילוי פרטיכם.",
  },
  {
    question: "מה להביא וכמה זמן לפני האירוע כדאי להגיע?",
    answer: `בבוקר האירוע נשלח אליכם ואטסאפ עם כל המידע הרלוונטי לגבי פתיחת שערים ועומסים צפויים, ככה שתוכלו לתכנן את היום באופן מיטבי. 📩 חשוב לקרוא את ההנחיות שנשלח. הביאו איתכם: טלפון נייד (לכרטיסים וליצירת קשר במידת הצורך) ותעודה מזהה לכל משתתף`,
  },
  {
    question: "איך מקבלים את הכרטיסים?",
    answer: `כרטיסי הטיסה ושובר המלון ישלחו אליכם למייל מיד לאחר סיום ההזמנה והתשלום. הכרטיסים לאירוע ישלחו אליכם כשבועיים עד 24 שעות לפני מועד האירוע, בהתאם למועד הפצת הכרטיסים של מארגני האירוע.`,
  },
  {
    question: "האם יש הנחות לקבוצות?",
    answer:
      "בהחלט! אנו מציעים הנחות לקבוצות של 10 משתתפים ומעלה. לפרטים נוספים ניתן לפנות לשירות הלקוחות.",
  },
  {
    question: "האם ניתן לבטל הזמנה?",
    answer: `כן, ניתן לבטל בהתאם למדיניות הביטולים המפורטת ב"תנאים והגבלות" של ההזמנה.  
במקרה הצורך, אנחנו זמינים לסיוע בטלפון או בוואטסאפ: 054-200-2722.`,
  },
];

export function FAQ() {
  return (
    <section className="w-full py-10 px-4 md:px-6 max-w-3xl mx-auto">
      <h2 className="text-2xl font-bold text-secondary text-center mb-8">
        שאלות נפוצות
      </h2>
      <div className="space-y-4" dir="rtl">
        <FAQAccordion items={faqItems} />
      </div>
    </section>
  );
}
