export const dynamic = "force-static"; // This is optional, but good for fully static pages
export const revalidate = 3600; // Optional: revalidate every hour

export default function CancelPage() {
  return (
    <div className="container mx-auto p-6" dir="rtl">
      <h1 className="text-3xl font-bold mb-6 text-center">תנאים ומידע כללי</h1>
      <p>
        מוצרי התיירות המוצעים באתר אינטרנט זה, מוצעים לציבור על ידי &quot;מגה
        איבנטס&quot; מרחוב ראול ולנברג תל אביב בתנאים המפורטים להלן, ועצם הרשמת
        הנוסע מהווה את הסכמתו המפורשת לתנאים אלה. הנוסע מצהיר כי ידוע לו שאתר זה
        והתנאים והמידע הכללי מהווים את חוזה ההתקשרות בינו לבין מגה איבנטס וגם/או
        כל מי שיבוא מכוחם (להלן: המארגנים), והוא יהיה מנוע מלטעון כי אין התנאים
        והמידע הכללי המפורטים באתר זה מחייבים אותו בכל הקשור למוצרי התיירות
        שירכוש כמפורט באתר זה. אין המארגנים אחראיים לכל מידע שלא יימסר על ידם
        בכתב ואינם קשורים בכל מידע וגם/או בהבטחות שניתנו בע&quot;פ על ידם וגם/או
        על ידי שולחיהם וגם/או מטעמם, ושלא נתקבל לו אישור בכתב על ידם. בכל מקרה
        של חילוקי דעות יחייבו הוראות אלו. לא תשמע כל טענה של נוסע, כי לא קרא את
        התנאים והמידע הכללי המופיעים באתר זה, וגם/או כי לא הופנתה תשומת ליבו
        לתנאים ולמידע הכללי קודם הרשמתו לטיולים וגם/או לטיול בו השתתף.
      </p>
      <h2 className="mt-4">נוסע יקר,</h2>
      <p>
        התנאים והנהלים המובאים להלן, מהווים חלק בלתי נפרד מהזמנתך. ביצוע הזמנתך
        לכל אחד ממוצרי התיירות של מגה איבנטס מהווה אישור מלא לכל התנאים והנהלים
        המופיעים מטה ולכן באחריותך לקרוא בעיון רב את תנאי ההתקשרות.
      </p>

      <h3 className="mt-4">תנאים והגבלת אחריות:</h3>
      <p>
        <strong>כללי –</strong> &quot;מגה איבנטס&quot; (להלן: הספקית) משמשת
        כמתווכת או מקשרת בלבד בין הנוסעים לבין ספקי השירותים בארץ ובחו&quot;ל
        (כגוון: בתי מלון, חברות תעופה, אטרקציות וכד&apos;), בהתאם לפרטים
        המפורטים במסגרת כל הזמנה, כאשר האחריות על ביצוע השירותים בפועל לרבות
        טיבם ואיכותם מוטלת במלואה על ספקי שירות אלו, למעט במקרים בהם ניתן להטיל
        אשם על הספקית.
      </p>
      <p>
        הספקית מתחייבת לבצע כל הזמנה במקצוענות ובמיומנות, ולמסור את כל המידע
        הרלוונטי לעסקה. הספקית אינה אחראית בכל צורה שהיא לתקלות כלשהן הנובעות
        עקב ביצוע לקוי ו/או חלקי של השירותים המבוצעים ע&quot;י ספקי השירות ו/או
        כאלו הנובעות עקב נסיבות שאינן בשליטתה (כגוון: שביתות, רעידות אדמה, אסון
        טבע, ימי חג, מגיפות, פשיטות רגל, תקלות טכניות ביטולי טיסות וכדומה.)
      </p>
      <p>
        יודגש כי בטרם אישורה הסופי של כל הזמנה ע&quot;י ספקי השירות בארץ או
        בחו&quot;ל, תיחשב כל הזמנה על תנאי עד למועד אישורה הסופי ולפיכך לא תחייב
        את הספקית, אלא תהיה בגדר בקשה לביצוע הזמנה בלבד. מוסכם בזאת שכל תביעה
        ו/או טענה ו/או תלונה של נוסע כנגד השירותים המוזמנים תובא בפני הספקית
        בזמן אמת ומייד עם היוודע לנוסע על התקלה או במועד הקרוב לכך, ככל הניתן.
      </p>

      <h3 className="mt-4">תנאי דמי ביטול:</h3>
      <p>
        <strong>חיובים וביטולים –</strong> מחובתו של כל לקוח להתעדכן ולהבין את
        משמעות דמי הרישום והטיפול ו/או דמי הביטול בכל מוצר ו/או שירות בהתאם
        לתנאי הספק ו/או בהתאם לתנאים המפורטים מטה.
      </p>
      <p>
        שימו לב! במידה ותאלץ לבטל את הזמנתך חלים דמי שינוי ו/או דמי ביטול כפי
        שפורטו לעיל מרגע ביצוע ואישור ההזמנה והכל בכפוף להוראות חוק הגנת הצרכן,
        התשמ&quot;א – 1981:
      </p>
      <ul>
        <li>
          <strong>
            א. עסקת מכר מרחוק, כהגדרתה בחוק הגנת הצרכן (תיקון מס&apos; 26 לחוק):
          </strong>{" "}
          רשאי הצרכן לבטל את העסקה בתוך 14 ימים מרגע ביצוע העסקה ובלבד שהביטול
          יעשה לפחות 7 ימים עבודה קודם למועד בו אמור השירות להינתן ובכתב.
        </li>
        <li>
          <strong>ב. עסקת מכר מרחוק לפי תיקון 47 לחוק הגנת הצרכן:</strong> רשאי
          צרכן בן 65 ומעלה ו/או אדם עם מוגבלות ו/או עולה חדש, לבטל את העסקה
          ארבעה חודשים מיום ביצועה.
        </li>
        <li>
          ג. רשאי צרכן לבטל חוזה, עד 14 ימים ממועד כריתתו עקב פגם או אי התאמה
          בין השירות שסופק לשירות שפרטיו נמסרו לצרכן או עקב אי אספקת השירות
          במועד או כל הפרה אחרת של החוזה וזאת ללא דמי ביטול.
        </li>
      </ul>

      <p>
        יובהר למען הסר ספק כי האמור בסעיף זה הינו לצורכי יידוע בלבד, וכי הנוסח
        המחייב והמלא של הוראות הביטול בעסקאות מכר מרחוק הוא זה המפורט בסעיף
        14(ג) לחוק הגנת הצרכן.
      </p>
      <p>
        יובהר למען הסר ספק כי כל ביטול מחייב את הנוסע בדמי טיפול ורישום שלא
        יוחזרו בכל מקרה של ביטול. בנוסף ביטול הנעשה בדמי ביטול מלאים (100% מערך
        העסקה) לא יקנה זכות כלשהיא לנוסע, לרבות לא החזר כספי כלשהוא, למעט החזר
        בגין מיסי נמל והיטלי ביטחון ששולמו בהזמנת כרטיסי טיסה. לבקשת הנוסע
        הספקית תפנה אל חברת התעופה הרלוונטית לשם קבלת החזר בגין האמור בלבד ועבור
        הנוסע.
      </p>

      <h3 className="mt-4">מצב בטחוני מיוחד</h3>
      <p>
        עקב המצב הבטחוני (אולם לא רק) המתמשך ייתכנו שינויים בשעות הטיסות (הלוך
        או חזור) שיחייבו שינוי במסלול. אנו נעדכן את הנוסעים עם קבלת המידע על
        השינוי.
      </p>

      <h3 className="mt-4">דרכי הודעת ביטול עסקה:</h3>
      <ul>
        <li>באמצעות טופס זה: לחצו כאן</li>
        {/*TODO: Add link to cancel form*/}
        <li>ווטסאפ &quot;מגה איבנטס&quot; – 054-2272554</li>
        {/*TODO: another number?*/}
        <li>בדואר אלקטרוני לכתובת: invoicesmyt@gmail.com</li>
        {/*TODO: change email address*/}
      </ul>
      <p>
        כל הפניות שיתקבלו באמצעים המפורטים מעלה יטופלו בימים א&apos;-ה&apos; בין
        השעות 09:00-16:00 (להלן: שעות הפעילות). פניות שיתקבלו לאחר שעות הפעילות
        וימי הפעילות יטופלו ביום הפעילות העוקב.
      </p>

      <h3 className="mt-4">קבלת מסמכי נסיעה:</h3>
      <p>
        על הנוסע לבדוק את כל מסמכי הנסיעה, מיד עם קבלתם ולוודא כי כל המסמכים
        הרלוונטיים אכן בידיו (כגון: כרטיסי טיסה, שוברים לבתי מלון, להעברות,
        לאטרקציות וכדומה), לוודא כי כל הפרטים שרשומים שם נכונים, תואמים את
        ההזמנה ואת פרטי הנוסעים במדויק.
      </p>
    </div>
  );
}
